<?php

    function arrx($array=array()) {
        header('Content-Type: text/html; charset=utf-8');
        $numargs = func_num_args();

        echo "<pre>";

        echo "| ================================================================================<br/>";
        echo "| DEBUG MODE<br/>";
        echo "| ================================================================================<br/><br/><br/>";

        for ($i=0; $i < $numargs; $i++) {
            print_r( func_get_arg($i) );
            echo "<br><br>";
        }

        echo "<br/><br/><br/>| ================================================================================<br/>";
        echo "| END DEBUG<br/>";
        echo "| ================================================================================<br/><br/><br/>";
        echo "</pre>"; exit;
        exit;
    }

    function convertDateTime($datetime = "now", $timezone = "Asia/Bangkok") {
        try {
            $dt = new DateTime($datetime, new DateTimeZone($timezone));
            return $dt->format("Y-m-d H:i:s");
        } catch (Exception $e) {
            error_log("Date conversion error: " . $e->getMessage());
            return null;
        }
    }

    function setDateTimeFormat($datetime, $formatDate = "d-m-Y", $yearFormat = "TH", $timezone = "Asia/Bangkok") {
        try {
            $dt = new DateTime($datetime, new DateTimeZone($timezone));
            $formatted = $dt->format($formatDate);

            if (strtoupper($yearFormat) === "TH") {
                $year = (int)$dt->format("Y");
                $year_th = $year + 543;

                $formatted = preg_replace(
                    "/\b$year\b/u", 
                    $year_th, 
                    $formatted
                );
            }

            return $formatted;

        } catch (Exception $e) {
            error_log("Date conversion error: " . $e->getMessage());
            return null;
        }
    }

    function status($value) {
        $options = [
            "1" => "แบบร่าง",
            "2" => "รออนุมัติ",
            "3" => "ปรับปรุงประสิทธิภาพการผลิตให้มีศักยภาพและเป็นมิตรต่อสิ่งแวดล้อม (BCG)",
            "4" => "ส่งเสริมและพัฒนาสถาบันเกษตรกรชาวสวนยางและ",
            "5" => "ขับเคลื่อนเศรษฐกิจเพื่อความยั่งยืน (BCG)",
            "6" => "โฉนดต้นยางพาราเพื่อเป็นหลักประกันสินเชื่อ",
            "7" => "ขับเคลื่อนเพื่อเพิ่มศักยภาพการจัดการสวนยางตามหลัก GAP",
            "8" => "การพัฒนาการผลิต และการแปรรูปของเกษตรกร สถาบันเกษตรกรให้เข้าสู่มาตรฐาน",
            "9" => "สนับสนุนเครือข่ายตลาดกลางยางพารา",
            "10" => "เงินให้กู้ยืมและเงินอุดหนุน ตามมาตรา 49 (3)",
        ];

        return isset($options[$value]) ? $options[$value] : null;
    }

    function getYears() {
        return [
            "2568" => "2568",
            "2569" => "2569",
            "2570" => "2570"
        ];
    }

    function getVersions() {
        return [
            "1" => "ระดับสาขา",
            "2" => "ระดับจังหวัด/กอง",
            "3" => "ระดับเขต/ฝ่าย",
            "4" => "ระดับผู้รับผิดชอบหลัก",
            "5" => "ระดับฝ่ายยุทธ์ศาสตร์"
        ];
    }

    function getVersionApprove($id) {
        $data = [
            "1" => "APBR",
            "2" => "APPV",
            "3" => "APAR",
            "4" => "APPRP",
            "5" => "APSTR"
        ];

        return isset($data[$id]) ? $data[$id] : null;
    }

    function getPositionCode() {
        $user = $_SESSION['user_data'];
 
        return $user['position_list'][0]['position_code'];
    }

    function getProjectTypes() {
        return [
            "1" => "โครงการเดิม",
            "2" => "โครงการใหม่"
        ];
    }

    function getOriginalProject() {
        return [
            "1" => "โครงการระยะสั้น",
            "2" => "โครงการต่อเนื่อง"
        ];
    }

    function getStrategicObjectives()
    {
        return [
            "SO1" => "SO1 ผลักดันความร่วมมือของกลุ่มผู้มีส่วนได้ส่วนเสียตลอดห่วงโซ่อุปทานเพื่อยกระดับความสามารถทางการแข่งขันของประเทศไทยบนพื้นฐานของงานวิจัย เทคโนโลยีและนวัตกรรมที่เป็นมิตรต่อสิ่งแวดล้อม",
            "SO2" => "SO2 เพิ่มมูลค่ายางด้วยงานวิจัย เทคโนโลยี และนวัตกรรม",
            "SO3" => "SO3 สร้างองค์กรที่มีสมรรถนะสูง ขับเคลื่อนด้วยเทคโนโลยีและนวัตกรรม บนพื้นฐานของการกำกับดูแลที่ดีโปร่งใส สามารถตรวจสอบได้",
            "SO4" => "SO4 บริหารจัดการรายได้ รายจ่าย และสินทรัพย์ขององค์กรให้เกิดประโยชน์สูงสุด",
        ];
    }

    function getNationalStrategies()
    {
        return [
            "yot1" => "ยุทธศาสตร์ที่ 1 พัฒนาอุตสาหกรรมยางพาราอย่างยั่งยืน",
            "yot2" => "ยุทธศาสตร์ที่ 2 สร้างนวัตกรรมเพื่อความยั่งยืน",
            "yot3" => "ยุทธศาสตร์ที่ 3 พัฒนาสู่องค์กรแห่งความรู้ที่มีสมรรถนะสูง (KO&HPO)",
            "yot4" => "ยุทธศาสตร์ที่ 4 พัฒนาสู่องค์กรแห่งความรู้ที่มีสมรรถนะสูง (KO&HPO)",
        ];
    }

    function getIndicators()
    {
        return [
            "yot11" => "1.1 พื้นที่สวนยางยั่งยืนเพิ่มขึ้นไม่น้อยกว่า (ของเป้าหมายปลูกแทน) ร้อยละ 12.5",
            "yot12" => "1.2 จำนวนสถาบันเกษตรกร/ผู้ประกอบการที่ได้รับมาตรฐาน จำนวน 7 แห่ง",
            "yot13" => "1.3 มูลค่าการส่งออกผลิตภัณฑ์ยางพาราเพิ่มขึ้น จำนวน 550,000 ล้านบาท",
            "yot21" => "2.1 จำนวนงานวิจัยด้านนวัตกรรมที่ กยท./เกษตรกร/สถาบันเกษตรกร/ผู้ประกอบการ/ Start-up นำไปใช้จำนวน 6 เรื่อง",
            "yot22" => "2.2 จำนวนงานวิจัย/นวัตกรรมที่ยื่นจดทะเบียนทรัพย์สินทางปัญญาเพิ่มขึ้น จำนวน 6 เรื่อง",
            "yot23" => "2.3 สนับสนุนการจัดทำฐานข้อมมูลนักวิจัย 1 ระบบ",
            "yot31" => "3.1 ผลการดำเนินงานการบริหารทุนมนุษย์ ผ่านเกณฑ์ SE-AM ระดับ 3.50",
            "yot32" => "3.2 ผลการดำเนินงานการพัฒนาเทคโนโลยีดิจิทัล ผ่านเกณฑ์ SE-AM ระดับ 3.20",
            "yot33" => "3.3 ความพึงพอใจของผู้ใช้บริการ และผู้มีส่วนได้ส่วนเสียเฉลี่ย ไม่ต่ำกว่าร้อยละ 90",
            "yot34" => "3.4 คะแนน ITA ไม่ต่ำกว่า 95 คะแนน",
            "yot41" => "4.1 กำไรจากการดำเนินธุรกิจ (ขั้นต้น) จำนวน 147 ล้านบาท",
            "yot42" => "4.2 รายได้ค่าธรรมเนียมการส่งออก จำนวน 8,173 ล้านบาท",
            "yot43" => "4.3 ความพึงพอใจของผู้ชำระค่าธรรมเนียม ไม่ต่ำกว่าร้อยละ 90",
        ];
    }

    function getStrategies()
    {
        return [
            "yot11" => "กลยุทธ์ที่ 1.1 ส่งเสริมการจัดการสวนยาง และการแปรรูปยางอย่างยั่งยืน",
            "yot12" => "กลยุทธ์ที่ 1.2 สนับสนุนมาตรฐานแหล่งผลิตและสินค้ายาง",
            "yot13" => "กลยุทธ์ที่ 1.3 สร้างสภาพแวดล้อมที่เอื้ออำนวยต่อการพัฒนาของอุตสาหกรรมยางอย่างยั่งยืน",
            "yot21" => "กลยุทธ์ที่ 2.1 สนับสนุนการวิจัยเทคโนโลยีและนวัตกรรมยาง",
            "yot22" => "กลยุทธ์ที่ 2.2 ส่งเสริมให้เกษตรกร และผู้ประกอบกิจการยางประยุกต์ใช้เทคโนโลยี นวัตกรรม ในเชิงพาณิชย์และสังคม",
            "yot23" => "กลยุทธ์ที่ 2.3 จัดตั้งเครือข่ายนักวิจัยด้านยางพารา",
            "yot31" => "กลยุทธ์ที่ 3.1 พัฒนาทรัพยากรมนุษย์ให้มีขีดความสามารถสูง",
            "yot32" => "กลยุทธ์ที่ 3.2 พัฒนาเป็นองค์กรดิจิตัล และองค์กรแห่งความรู้",
            "yot33" => "กลยุทธ์ที่ 3.3 ส่งเสริมความสัมพันธ์กับผู้มีส่วนได้ส่วนเสีย",
            "yot34" => "กลยุทธ์ที่ 3.4 บริหารจัดการองค์กรอย่างมีธรรมาภิบาล",
            "yot41" => "กลยุทธ์ที่ 4.1 สร้างและพัฒนาธุรกิจองค์กรให้มีศักยภาพแข่งขันในระดับสากล",
            "yot42" => "กลยุทธ์ที่ 4.2 เพิ่มประสิทธิภาพการจัดเก็บค่าธรรมเนียมส่งออกยาง",
            "yot43" => "กลยุทธ์ที่ 4.3 เพิ่มประสิทธิภาพการบริหารการคลัง",
        ];
    }

    function getPlanTypes()
    {
        return [
            "1" => "แผนงานด้านธุรกิจ",
            "2" => "แผนงานบริหารทั่วไป",
            "3" => "แผนงานขับเคลื่อนของยุทธศาสตร์ กยท.",
            "4" => "แผนงานพื้นฐานสนับสนุนการดำเนินงานของ กยท.แผนงานพื้นฐานสนับสนุนการดำเนินงานของ กยท.",
            "5" => "แผนงานตามนโยบายภาครัฐ เงินอุดหนุนรัฐบาล"
        ];
    }

    function getRiskColor($value) 
    {
        if($value >= 1 && $value <= 2) {
            return 'bg_warning1';
        } else if($value >= 3 && $value <= 4) {
            return 'bg_warning2';
        } else if($value >= 5 && $value <= 9) {
             return 'bg_warning3';
        } else if($value >= 10 && $value <= 16) {
             return 'bg_warning4';
        } else if($value >= 17 && $value <= 25) {
             return 'bg_warning5';
        }
    }
    
    function getPositionApproveCode() 
    {
        return [
            "APBR" => "ระดับสาขา",
            "APPV" => "ระดับจังหวัด/กอง",
            "APAR" => "ระดับเขต/ฝ่าย",
            "APPRP" => "ระดับผู้รับผิดชอบหลัก",
            "APSTR" => "ระดับฝ่ายยุทธ์ศาสตร์"
        ];
    }

    function getNextApprove($code) 
    {
        $data = [
            "APBR" => "APPV",
            "APPV" => "APAR",
            'APPRP' => 'APPRP',
            "APAR" => "APSTR",
        ];

        if(isset($data[$code])) {
            return $data[$code];
        } else {
            return null;
        }
    }

    function getStatus($status, $value = '', $depart = false) {

        if($status == 'draft') {
            return 'บันทึกร่าง';
        } else if($status == 'waiting' && $value != '' && !$depart) {
            $approve = getPositionApproveCode();

            return 'รออนุมัติ ' . $approve[$value];
        } else if($status == 'waiting' && $depart) {
            return 'รออนุมัติ ';
        } else if($status == 'approved') {
            return 'อนุมัติแล้ว';
        } else if($status == 'rejected') {
            return 'ไม่อนุมัติ';
        } else {
            return 'ไม่พบสถานะข้อมูล';
        }
    } 
?>